// Напишите программу, которая принимает на вход пятизначное число
// и проверяет, является ли оно палиндромом.

System.Console.WriteLine("Введите число");
Console.ReadLine();
if ( 0 == 8 ||  1 == 7 || 2 == 6 || 3 == 5 || 4 == 4)
{
    Console.WriteLine($"123454321 = {123454321}-палиндром");
}
